package rosstat

// QueryDimensions содержит все фильтры из параметра Qry
// Эти данные определяют, ЧТО именно мы запрашиваем у росстата
type QueryDimensions struct {
	Pokazateli []int // коды показателей (численность населения и тд)
	Munr       []int // коды муниципальных районов
	Tippos     []int // типы поселений (городские/сельские)
	Oktmo      []int // детальные коды ОКТМО - территорий
	Vozr       int   // возраст (151 – все возраста)
	Grup_2     []int // возрастные группы (1,2,3)
	God        []int // годы (2009–2025)
	Period     int   // период (208 – год)
	Mest       []int // место проживания (11,12,13)
}

// QueryGm содержит настройки группировки из параметра QryGm
// Они определяют, как сворачивать данные (по годам, территориям и тд)
type QueryGm struct {
	Vozr_z       int // группировка по возрасту (1 — включена)
	Period_z     int // группировка по периоду (2 — по годам)
	God_s        int // сортировка по годам (1 — по возрастанию)
	Munr_b       int // группировка по муниципальным районам (1 — включена)
	Oktmo_b      int // группировка по ОКТМО (2 — детальная)
	Grup_2_b     int // группировка по возрастным группам (3 — включена)
	Pokazateli_b int // группировка по показателям (4 — включена)
	Tippos_b     int // группировка по типам поселений (5 — включена)
	Mest_b       int // группировка по месту проживания (6 — включена)
}

// RequestParams объединяет все параметры запроса к API росстата
type RequestParams struct {
	Format       string          // "CSV"
	YearFrom     int             // начальный год
	YearTo       int             // конечный год
	DiagSz       string          // размер диагонали окна
	Qry          QueryDimensions //основные измерения - то что запрашиваем
	QryGm        QueryGm         //настройки группировки
	QryFootNotes string          // примечания - пустая строка обычно
	YearsList    []int           //  список годов (дублирует Qry.God, но нужен для совместимости)
	Tbl          string          // текст кнопки "Показать таблицу"
}

// Config содержит настройки HTTP-клиента для скачивания
type Config struct {
	BaseURL   string //базовый адрес CGI-скрипта росстата
	Timeout   int    //таймаут HTTP-запроса в секундах
	UserAgent string //строка User-Agent для запроса
	Referer   string //значение заголовка Referer
	Accept    string //значение заголовка Accept
}
